#+STARTUP: content hideblocks
#+TODO: TODO(!) | DONE(@)

* DText Additions
** Tags

- [ ] tn (e.g., ~[tn]example[/tn]~)
- [ ] spoilers (e.g., ~[spoilers]example[/spoilers]~)
- [ ] nodtext (e.g., ~[nodtext]example[/nodtext]~)
- [ ] expand (see *[[Expand Tag]]*)

*** Expand Tag

#+caption: Demonstration
#+begin_src bbcode
[expand]
This creates a collaspible block of text.
[/expand]

[expand=Custom Title]
This creates a collaspible block of text.
[/expand]
#+end_src

** TODO Links
   DEADLINE: <2023-10-29 Sun 17:00>
   :LOGBOOK:
   CLOCK: [2023-10-29 Sun 15:09]--[2023-10-29 Sun 15:17] =>  0:08
   CLOCK: [2023-10-29 Sun 15:01]--[2023-10-29 Sun 15:04] =>  0:03
   CLOCK: [2023-10-29 Sun 14:08]--[2023-10-29 Sun 14:33] =>  0:25
   CLOCK: [2023-10-29 Sun 03:28]--[2023-10-29 Sun 03:32] =>  0:04
   CLOCK: [2023-10-29 Sun 02:51]--[2023-10-29 Sun 03:03] =>  0:12
   :END:

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2023-10-29 Sun 19:04]
| Headline     | Time   |      |
|--------------+--------+------|
| *Total time* | *4:20* |      |
|--------------+--------+------|
| \_  Links    |        | 4:20 |
#+END:

*** URL Links
    DEADLINE: <2023-10-29 Sun 17:00>
    :LOGBOOK:
    CLOCK: [2023-10-29 Sun 15:26]--[2023-10-29 Sun 16:58] =>  1:32
    :END:

**** TODO Font Lock
     - State "TODO"       from              [2023-11-05 Sun 00:09]
     :LOGBOOK:
     CLOCK: [2023-11-07 Tue 18:35]
     CLOCK: [2023-11-05 Sun 00:08]--[2023-11-05 Sun 01:04] =>  0:56
     CLOCK: [2023-10-31 Tue 22:40]--[2023-10-31 Tue 22:47] =>  0:07
     CLOCK: [2023-10-29 Sun 19:08]--[2023-10-29 Sun 19:10] =>  0:02
     CLOCK: [2023-10-29 Sun 17:35]--[2023-10-29 Sun 19:04] =>  1:29
     CLOCK: [2023-10-29 Sun 16:59]--[2023-10-29 Sun 17:26] =>  0:27
     :END:

- [ ] bare link (e.g., ~example.com~)
- [ ] angled link (e.g., ~<example.com>~
- [ ] link with text
  - [ ] link to an arbitrary URL (e.g., ~"Example":[example.com]~)
  - [ ] link to a Danbooru page (e.g., ~"TOS":[/terms_of_service]~)
  - [ ] link to a header (e.g., ~"Here":[#dtext-basic-formatting]~)
- [ ] Markdown-style link (e.g., ~[Example](example.com)~)
- [X] wiki links [3/3]
  - [X] normal link (e.g., ~[[Kantai Collection]]~)
  - [X] link with alternate text (e.g., ~[[Kantai Collection|Kancolle]]~)
  - [X] link sans qualfieir (e.g., ~[[Fate (series)|]]~)
- [ ] search link (e.g. ~{{kantai_collection comic}}~)
- [ ] user (e.g., ~@bob~)

**** Insertion Functions                                       :syntax_table:

- [ ] bare link (e.g., ~example.com~)
- [ ] angled link (e.g., ~<example.com>~
- [ ] link with text (e.g., ~"Example":[example.com]~)
  - [ ] link to a Danbooru page (e.g., ~"TOS":[/terms_of_service]~)
  - [ ] link to a header (e.g., ~"Here":[#dtext-basic-formatting]~)
- [ ] Markdown-style link (e.g., ~[Example](example.com)~)
- [ ] wiki links [0/3]
  - [ ] normal link (e.g., ~[[Kantai Collection]]~)
  - [ ] link with alternate text (e.g., ~[[Kantai Collection|Kancolle]]~)
  - [ ] link sans qualfieir (e.g., ~[[Fate (series)|]]~)
- [ ] search link (e.g. ~{{kantai_collection comic}}~)
- [ ] user (e.g., ~@bob~)

*** TODO Post Links

- [X] link to post (e.g., ~post #1~)
- [ ] link to forum topic [0/2]
  - [ ] default (page 1) (e.g., ~topic #1~)
  - [ ] by page (e.g., page 2) (e.g., ~topic #1/2~)
- [X] link to forum post (e.g., ~forum #1~)
- [X] link to comment (e.g., ~comment #1~)
- [X] link to pool (e.g., ~pool #1~)
- [X] link to favorite group (e.g., ~favgroup #1~)
- [X] link to wiki (e.g., ~wiki #1~)
- [X] link to user (e.g., ~user #1~)
- [X] link to ban (e.g., ~ban #1~)
- [X] link to user feedback (e.g., ~feedback #1~)
- [X] link to ban appeal (e.g., ~appeal #1~)
- [X] link to post flag (e.g., ~flag #1~)
- [X] link to translation note (e.g., ~note #1~)
- [X] link to bulk update request (e.g., ~BUR #1~)
- [X] link to tag alias (e.g., ~alias #1~)
- [X] link to tag implication (e.g., ~implication #1~)
- [X] link to mod action (e.g., ~mod action #1~)
- [X] link to artist (e.g., ~artist #1~)

----------

- [X] link to Github issue (e.g., ~issue #1~)
- [X] link to Pixiv post (e.g., ~pixiv #1~)
- [X] link to Pawoo post (e.g., ~pawoo #1~)
- [X] link to NicoSeiga post (e.g., ~seiga #1~)
- [X] link to Nijie post (e.g., ~nijie #1~)
- [X] link to Twitter post (e.g., ~twitter #1~)
- [X] link to DeviantArt post (e.g., ~deviantart #1~)
- [X] link to ArtStation post (e.g., ~artstation #1~)
- [X] link to Sankaku post (e.g., ~sankaku #1~)
- [X] link to Gelbooru post (e.g., ~gelbooru #1~)
- [X] link to Yande.re post (e.g., ~yandere #1~)

** Tables

#+caption: Table syntax
#+begin_src bbcode
[table]
  [thead]
    [tr]
      [td]A[/td]
      [td]B[/td]
      [td]C[/td]
    [/tr]
  [/thead]
  [tbody]
    [tr]
      [td]1[/td]
      [td]2[/td]
      [td]3[/td]
    [/tr]
    [tr]
      [td]4[/td]
      [td]5[/td]
      [td]6[/td]
    [/tr]
  [/tbody]
[/table]
#+end_src

This creates the following result:

| A | B | C |
|---+---+---|
| 1 | 2 | 3 |
| 4 | 5 | 6 |

Mainly need a command for inserting tables, not really any extra
syntax/highlighting for them.

** DONE Headers
   DEADLINE: <2023-10-30 Mon 17:00>
   :LOGBOOK:
   CLOCK: [2023-10-29 Sun 20:56]--[2023-10-29 Sun 21:16] =>  0:20
   CLOCK: [2023-10-29 Sun 19:30]--[2023-10-29 Sun 20:40] =>  1:10
   :END:

#+begin_src dtext
h1. Header
h2. Header
h3. Header
h4. Header
h5. Header
h6. Header
#+end_src

These produce headers 1-5, but Danbooru users typically use 4, 5 and 6 in place
of 1, 2, and 3, respectively. But all six headers will become part of the
language regardless. with that in mind...

- [X] Header 1
- [X] Header 2
- [X] Header 3
- [X] Header 4
- [X] Header 5
- [X] Header 6

** Lists

#+caption: A demonstration of lists
#+begin_src bbcode
​* item 1
​* item2
​** item 2.a
​** item 2.b
​* item 3
#+end_src

Output:

- item 1
- item2
  - item 2.a
  - item 2.b
- item 3

** HTML Tags

Some day in the future, but not anytime soon.
